In [1]:
import pandas as pd

# Create a sample DataFrame
data = {'Name': ['Imen', 'Karthika', 'Cosimo', 'Cathrine'],
        'Age': [25, 30, 22, 35],
        'Salary': [50000, 60000, 45000, 70000]}

df = pd.DataFrame(data)
df

       Name  Age  Salary
0      Imen   25   50000
1  Karthika   30   60000
2    Cosimo   22   45000
3  Cathrine   35   70000

In [4]:
sorted_df = df.sort_values(by = 'Age')
sorted_df

       Name  Age  Salary
2    Cosimo   22   45000
0      Imen   25   50000
1  Karthika   30   60000
3  Cathrine   35   70000